In [1]:
import pandas as pd

In [5]:
CCTV_Seoul = pd.read_csv('C:/Users/USER/Desktop/2016726091/DataScience/day1/01. CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [7]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [8]:
CCTV_Seoul.columns[0]

'기관명'

In [9]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [10]:
CCTV_Seoul = pd.read_excel("C:/Users/USER/Desktop/2016726091/DataScience/day1/01. population_in_Seoul.xls", encoding='utf-8')
CCTV_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [14]:
pop_Seoul = pd.read_excel("C:/Users/USER/Desktop/2016726091/DataScience/day1/01. population_in_Seoul.xls", 
                          header = 2, 
                          usecols = 'B, D, G, J, N', 
                          encoding='utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [15]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별',
                         pop_Seoul.columns[1] : '인구수',
                         pop_Seoul.columns[2] : '한국인',
                         pop_Seoul.columns[3] : '외국인',
                         pop_Seoul.columns[4] : '고령자'}, inplace = True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [16]:
import pandas as pd
import numpy as np

In [17]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [18]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.999190  1.423361 -0.134757  0.789472
2013-01-02 -0.572734 -0.749748 -1.766686  1.366817
2013-01-03 -0.236762  1.066653  0.036250 -1.024930
2013-01-04  1.182217 -0.306250 -0.477980 -0.275904
2013-01-05  0.475251  0.239123 -0.937530 -1.624414
2013-01-06 -0.391691 -0.500131 -0.544398  0.797453

In [20]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.999190  1.423361 -0.134757  0.789472
2013-01-02 -0.572734 -0.749748 -1.766686  1.366817
2013-01-03 -0.236762  1.066653  0.036250 -1.024930

In [21]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
df.values

array([[-0.99918972,  1.42336063, -0.13475702,  0.78947195],
       [-0.57273399, -0.74974829, -1.7666855 ,  1.36681655],
       [-0.23676152,  1.06665304,  0.03625011, -1.02493019],
       [ 1.18221733, -0.30625044, -0.47797978, -0.27590406],
       [ 0.47525055,  0.23912305, -0.93752961, -1.62441395],
       [-0.39169051, -0.50013083, -0.54439824,  0.79745268]])

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [25]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.090485  0.195501 -0.637517  0.004749
std    0.788702  0.882905  0.648981  1.174102
min   -0.999190 -0.749748 -1.766686 -1.624414
25%   -0.527473 -0.451661 -0.839247 -0.837674
50%   -0.314226 -0.033564 -0.511189  0.256784
75%    0.297248  0.859771 -0.220563  0.795457
max    1.182217  1.423361  0.036250  1.366817

In [26]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-01 -0.999190  1.423361 -0.134757  0.789472
2013-01-03 -0.236762  1.066653  0.036250 -1.024930
2013-01-05  0.475251  0.239123 -0.937530 -1.624414
2013-01-04  1.182217 -0.306250 -0.477980 -0.275904
2013-01-06 -0.391691 -0.500131 -0.544398  0.797453
2013-01-02 -0.572734 -0.749748 -1.766686  1.366817

In [27]:
df['A']

2013-01-01   -0.999190
2013-01-02   -0.572734
2013-01-03   -0.236762
2013-01-04    1.182217
2013-01-05    0.475251
2013-01-06   -0.391691
Freq: D, Name: A, dtype: float64

In [28]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.090485  0.195501 -0.637517  0.004749
std    0.788702  0.882905  0.648981  1.174102
min   -0.999190 -0.749748 -1.766686 -1.624414
25%   -0.527473 -0.451661 -0.839247 -0.837674
50%   -0.314226 -0.033564 -0.511189  0.256784
75%    0.297248  0.859771 -0.220563  0.795457
max    1.182217  1.423361  0.036250  1.366817

In [29]:
df.iloc[3]

A    1.182217
B   -0.306250
C   -0.477980
D   -0.275904
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.182217 -0.306250
2013-01-05  0.475251  0.239123

In [31]:
df[df.A > 0]

                   A         B        C         D
2013-01-04  1.182217 -0.306250 -0.47798 -0.275904
2013-01-05  0.475251  0.239123 -0.93753 -1.624414

In [32]:
df[df > 0]

                   A         B        C         D
2013-01-01       NaN  1.423361      NaN  0.789472
2013-01-02       NaN       NaN      NaN  1.366817
2013-01-03       NaN  1.066653  0.03625       NaN
2013-01-04  1.182217       NaN      NaN       NaN
2013-01-05  0.475251  0.239123      NaN       NaN
2013-01-06       NaN       NaN      NaN  0.797453